esden/stm32cube-database/db/mcu/memory/STM32_DIE474_32_128.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32H5-128K" Dvendor="STMicroelectronics:13" info="ARM Cortex-M33, 32 KB RAM, 128 KB FLASH">
    <package info="STMicroelectronics STM32H5 Series Device Support" name="STM32H5xx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="160000000" Dcore="ARM Cortex-M33" DcoreVersion="r0p4_p1" Ddsp="DSP" Dendian="Little-endian" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" DnumInterrupts="125"  DnumMpuRegions="12" DnumSecMpuRegions="4" DnumSauRegions="4"/>
  </device>

  <resources>

    <sau_init>
      <region start="0x08000000" size="0x04000000" security="n" info="Non-Secure Code"/>
      <region start="0x20000000" size="0x10000000" security="n" info="Non-Secure RAM"/>
      <region start="0x40000000" size="0x10000000" security="n" info="Non-Secure Peripherals"/>
    </sau_init>

    <memories>
      <memory access="rx" info="Flash memory" name="Flash_NS" security="n" size="0x00020000" start="0x08000000" type="ROM"/>
      <memory access="rwx" info="SRAM Code" name="RAM_C_NS" physical="0x20000000" security="n" size="0x00008000" start="0x0A000000" type="RAM"/>

      <memory access="rx" info="Flash memory" name="Flash_S" physical="0x08000000" security="c" size="0x00020000" start="0x0C000000" type="ROM"/>
      <memory access="rwx" info="SRAM Code" name="RAM_C_S" physical="0x20000000" security="c" size="0x00008000" start="0x0E000000" type="RAM"/>

      <memory access="rwx" info="SRAM" name="SRAM_NS" security="n" size="0x00008000" start="0x20000000" type="RAM"/>

      <memory access="rwx" info="SRAM" name="SRAM_S" physical="0x20000000" security="c" size="0x00008000" start="0x30000000" type="RAM"/>

      <memory access="rw" info="Backup SRAM" name="BKPSRAM_NS" security="n" size="0x00000800" start="0x40036400" type="RAM"/>
      <memory access="rw" info="Backup SRAM" name="BKPSRAM_S" physical="0x40036400" security="c" size="0x00000800" start="0x50036400" type="RAM"/>

      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM1" name="GTZC1_MPCBB1" size="0x00004000" start="0x20000000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM2" name="GTZC1_MPCBB2" size="0x00004000" start="0x20004000" type="sp"/>

      <mpc blk_size="0x2000" info="Flash Bank1" name="FLASH_BB1" size="0x00010000" start="0x08000000" type="sp"/>
      <mpc blk_size="0x2000" info="Flash Bank2" name="FLASH_BB2" size="0x00010000" start="0x08010000" type="sp"/>

      <mpcwm sections="1" granularity="0x00000020" info="Backup SRAM" name="GTZC1_MPCWM4" size="0x00000800" start="0x40036400" type="sp"/>

      <mpcwm sections="1" granularity="0x00002000" info="Flash Bank1" name="FLASH_WM1" size="0x00010000" start="0x08000000" type="s"/>
      <mpcwm sections="1" granularity="0x00002000" info="Flash Bank2" name="FLASH_WM2" size="0x00010000" start="0x08010000" type="s"/>
    </memories>

   </resources>

</rzone>
